Antoniazdz/ot-nrf528xx/src/nrf54l15/nrf54_rcp_tput_stats.c
/*
 *  Copyright (c) 2026, The OpenThread Authors.
 *  SPDX-License-Identifier: BSD-3-Clause
 */

#include "nrf54_rcp_tput_stats.h"

#if NRF54_RCP_TPUT_STATS

#include "platform-nrf5.h"
#include "nrf54_rcp_tput_ncp_hook.h"
#include "nrf_802154_platform_rcp_tput_stats_hook.h"

#include <stdio.h>
#include <limits.h>

#include <SEGGER_RTT.h>

nrf54_rcp_tput_stats_t g_nrf54_rcp_tput_stats;

static volatile uint64_t sUartEndRxIrqUs;
static uint64_t          sLastUartDeliverUs;
static uint64_t          sRadioTxStartUs;
static uint64_t          sRadioTxFrameStartedUs;
static uint64_t          sRadioTxDoneUs;
static uint64_t          sRadioProcessTxDoneUs;
static uint64_t          sNotifyUartTxSendUs;
static uint64_t          sNotifyUartTxDoneUs;
static uint64_t          sNotifySpinelEndFrameUs;
static uint64_t          sNotifyEncodeAndSendUs;
static uint64_t          sHostCmdEndRxIrqUs;
static bool              sAwaitingHostCmd;
static bool              sBurstInterFrame;

uint64_t nrf54RcpTputStatsNowUs(void)
{
    return nrf5AlarmGetCurrentTime();
}

void nrf54RcpTputStatsRecordMax(uint32_t *aMaxField, uint32_t aValueUs)
{
    if (aMaxField != NULL && *aMaxField < aValueUs)
    {
        *aMaxField = aValueUs;
    }
}

void nrf54RcpTputStatsRecordSumMax(uint32_t *aSumField, uint32_t *aMaxField, uint32_t aValueUs)
{
    if (aSumField != NULL)
    {
        *aSumField += aValueUs;
    }

    nrf54RcpTputStatsRecordMax(aMaxField, aValueUs);
}

static void recordLatencySample(uint32_t *aMaxField, uint32_t *aSumField, uint32_t *aCountField, uint32_t aValueUs)
{
    if (aCountField != NULL)
    {
        (*aCountField)++;
    }

    nrf54RcpTputStatsRecordMax(aMaxField, aValueUs);

    if (aSumField != NULL)
    {
        *aSumField += aValueUs;
    }
}

static void recordLatencySampleMin(uint32_t *aMinField,
                                   uint32_t *aMaxField,
                                   uint32_t *aSumField,
                                   uint32_t *aCountField,
                                   uint32_t aValueUs)
{
    if (aMinField != NULL && *aMinField > aValueUs)
    {
        *aMinField = aValueUs;
    }

    recordLatencySample(aMaxField, aSumField, aCountField, aValueUs);
}

static void recordCsmaHistogram(uint32_t aCsmaUs)
{
    if (aCsmaUs < 320u)
    {
        g_nrf54_rcp_tput_stats.csma_hist_0_320++;
    }
    else if (aCsmaUs < 640u)
    {
        g_nrf54_rcp_tput_stats.csma_hist_320_640++;
    }
    else if (aCsmaUs < 1280u)
    {
        g_nrf54_rcp_tput_stats.csma_hist_640_1280++;
    }
    else if (aCsmaUs < 2000u)
    {
        g_nrf54_rcp_tput_stats.csma_hist_1280_2000++;
    }
    else
    {
        g_nrf54_rcp_tput_stats.csma_hist_2000_plus++;
    }
}

static void recordBurstSample(uint32_t *aMinField,
                              uint32_t *aMaxField,
                              uint32_t *aSumField,
                              uint32_t *aCountField,
                              uint32_t aValueUs)
{
    recordLatencySampleMin(aMinField, aMaxField, aSumField, aCountField, aValueUs);
}

static void recordBurstHostPathBreakdown(uint32_t aHostPathUs)
{
    uint32_t rcpNotifyUs   = 0;
    uint32_t hostRttUs     = 0;
    uint32_t rcpStackUs    = 0;
    uint32_t rcpUartPrepUs = 0;
    uint32_t rxProcUs      = 0;
    bool     haveNotify    = false;
    bool     haveHostRtt   = false;
    bool     haveStack     = false;
    bool     haveUartPrep  = false;
    bool     haveRxProc    = false;

    if (sNotifyUartTxDoneUs != 0 && sRadioTxDoneUs != 0 && sNotifyUartTxDoneUs >= sRadioTxDoneUs)
    {
        rcpNotifyUs = (uint32_t)(sNotifyUartTxDoneUs - sRadioTxDoneUs);
        haveNotify  = true;
    }

    if (sLastUartDeliverUs != 0 && sNotifyUartTxDoneUs != 0 && sLastUartDeliverUs >= sNotifyUartTxDoneUs)
    {
        hostRttUs   = (uint32_t)(sLastUartDeliverUs - sNotifyUartTxDoneUs);
        haveHostRtt = true;
    }

    if (sRadioProcessTxDoneUs != 0 && sRadioTxDoneUs != 0 && sRadioProcessTxDoneUs >= sRadioTxDoneUs)
    {
        rcpStackUs = (uint32_t)(sRadioProcessTxDoneUs - sRadioTxDoneUs);
        haveStack  = true;
    }

    if (sNotifyUartTxSendUs != 0 && sRadioProcessTxDoneUs != 0 && sNotifyUartTxSendUs >= sRadioProcessTxDoneUs)
    {
        rcpUartPrepUs = (uint32_t)(sNotifyUartTxSendUs - sRadioProcessTxDoneUs);
        haveUartPrep  = true;
    }

    if (sHostCmdEndRxIrqUs != 0 && sLastUartDeliverUs != 0 && sLastUartDeliverUs >= sHostCmdEndRxIrqUs)
    {
        rxProcUs   = (uint32_t)(sLastUartDeliverUs - sHostCmdEndRxIrqUs);
        haveRxProc = true;
    }

    (void)aHostPathUs;

    if (haveNotify)
    {
        recordBurstSample(&g_nrf54_rcp_tput_stats.burst_rcp_notify_min_us,
                          NULL,
                          &g_nrf54_rcp_tput_stats.burst_rcp_notify_sum_us,
                          &g_nrf54_rcp_tput_stats.burst_rcp_notify_count,
                          rcpNotifyUs);
    }

    if (haveHostRtt)
    {
        recordBurstSample(&g_nrf54_rcp_tput_stats.burst_host_rtt_min_us,
                          NULL,
                          &g_nrf54_rcp_tput_stats.burst_host_rtt_sum_us,
                          &g_nrf54_rcp_tput_stats.burst_host_rtt_count,
                          hostRttUs);
    }

    if (haveStack)
    {
        recordBurstSample(&g_nrf54_rcp_tput_stats.burst_rcp_stack_min_us,
                          NULL,
                          &g_nrf54_rcp_tput_stats.burst_rcp_stack_sum_us,
                          &g_nrf54_rcp_tput_stats.burst_rcp_stack_count,
                          rcpStackUs);
    }

    if (haveUartPrep)
    {
        recordBurstSample(&g_nrf54_rcp_tput_stats.burst_rcp_uart_prep_min_us,
                          NULL,
                          &g_nrf54_rcp_tput_stats.burst_rcp_uart_prep_sum_us,
                          &g_nrf54_rcp_tput_stats.burst_rcp_uart_prep_count,
                          rcpUartPrepUs);
    }

    if (haveRxProc)
    {
        recordBurstSample(&g_nrf54_rcp_tput_stats.burst_uart_rx_proc_min_us,
                          NULL,
                          &g_nrf54_rcp_tput_stats.burst_uart_rx_proc_sum_us,
                          &g_nrf54_rcp_tput_stats.burst_uart_rx_proc_count,
                          rxProcUs);
    }

    if (sNotifySpinelEndFrameUs != 0 && sRadioProcessTxDoneUs != 0 &&
        sNotifySpinelEndFrameUs >= sRadioProcessTxDoneUs)
    {
        recordBurstSample(&g_nrf54_rcp_tput_stats.burst_rcp_spinel_encode_min_us,
                          NULL,
                          &g_nrf54_rcp_tput_stats.burst_rcp_spinel_encode_sum_us,
                          &g_nrf54_rcp_tput_stats.burst_rcp_spinel_encode_count,
                          (uint32_t)(sNotifySpinelEndFrameUs - sRadioProcessTxDoneUs));
    }

    if (sNotifyEncodeAndSendUs != 0 && sNotifySpinelEndFrameUs != 0 &&
        sNotifyEncodeAndSendUs >= sNotifySpinelEndFrameUs)
    {
        recordBurstSample(&g_nrf54_rcp_tput_stats.burst_rcp_tasklet_defer_min_us,
                          NULL,
                          &g_nrf54_rcp_tput_stats.burst_rcp_tasklet_defer_sum_us,
                          &g_nrf54_rcp_tput_stats.burst_rcp_tasklet_defer_count,
                          (uint32_t)(sNotifyEncodeAndSendUs - sNotifySpinelEndFrameUs));
    }

    if (sNotifyUartTxSendUs != 0 && sNotifyEncodeAndSendUs != 0 && sNotifyUartTxSendUs >= sNotifyEncodeAndSendUs)
    {
        recordBurstSample(&g_nrf54_rcp_tput_stats.burst_rcp_hdlc_encode_min_us,
                          NULL,
                          &g_nrf54_rcp_tput_stats.burst_rcp_hdlc_encode_sum_us,
                          &g_nrf54_rcp_tput_stats.burst_rcp_hdlc_encode_count,
                          (uint32_t)(sNotifyUartTxSendUs - sNotifyEncodeAndSendUs));
    }
}

static void recordRadioTxLatencyHistogram(uint32_t aLatencyUs)
{
    if (aLatencyUs < 100u)
    {
        g_nrf54_rcp_tput_stats.radio_tx_lat_0_100++;
    }
    else if (aLatencyUs < 500u)
    {
        g_nrf54_rcp_tput_stats.radio_tx_lat_100_500++;
    }
    else if (aLatencyUs < 2000u)
    {
        g_nrf54_rcp_tput_stats.radio_tx_lat_500_2000++;
    }
    else
    {
        g_nrf54_rcp_tput_stats.radio_tx_lat_2000_plus++;
    }
}

