Antoniazdz/ot-nrf528xx/src/nrf54l15/nrf54_rcp_tput_stats.c
static void recordLptimerSlipHistogram(uint32_t aSlipTicks)
{
    g_nrf54_rcp_tput_stats.lptimer_fires++;

    if (aSlipTicks < 10u)
    {
        g_nrf54_rcp_tput_stats.lptimer_slip_0_10++;
    }
    else if (aSlipTicks < 50u)
    {
        g_nrf54_rcp_tput_stats.lptimer_slip_10_50++;
    }
    else if (aSlipTicks < 200u)
    {
        g_nrf54_rcp_tput_stats.lptimer_slip_50_200++;
    }
    else
    {
        g_nrf54_rcp_tput_stats.lptimer_slip_200_plus++;
    }

    g_nrf54_rcp_tput_stats.lptimer_slip_sum_ticks += aSlipTicks;
    g_nrf54_rcp_tput_stats.lptimer_slip_count++;
}

void nrf54RcpTputStatsInit(void)
{
    nrf54RcpTputStatsReset();
}

void nrf54RcpTputStatsReset(void)
{
    g_nrf54_rcp_tput_stats.magic   = NRF54_RCP_TPUT_STATS_MAGIC;
    g_nrf54_rcp_tput_stats.version = NRF54_RCP_TPUT_STATS_VERSION;
    g_nrf54_rcp_tput_stats.lat_radio_csma_min_us              = UINT32_MAX;
    g_nrf54_rcp_tput_stats.lat_radio_done_to_tx_enter_min_us  = UINT32_MAX;
    g_nrf54_rcp_tput_stats.lat_host_path_min_us               = UINT32_MAX;
    g_nrf54_rcp_tput_stats.lat_uart_to_radio_tx_min_us        = UINT32_MAX;
    g_nrf54_rcp_tput_stats.lat_radio_done_to_uart_min_us      = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_done_to_tx_enter_min_us      = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_host_path_min_us             = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_uart_to_radio_min_us         = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_csma_min_us                  = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_rcp_notify_min_us            = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_rcp_stack_min_us             = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_rcp_uart_prep_min_us         = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_host_rtt_min_us               = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_uart_rx_proc_min_us           = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_rcp_spinel_encode_min_us      = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_rcp_tasklet_defer_min_us      = UINT32_MAX;
    g_nrf54_rcp_tput_stats.burst_rcp_hdlc_encode_min_us        = UINT32_MAX;
    g_nrf54_rcp_tput_stats.uart_tx_busy                         = 0;

    sUartEndRxIrqUs           = 0;
    sLastUartDeliverUs        = 0;
    sRadioTxStartUs           = 0;
    sRadioTxFrameStartedUs    = 0;
    sRadioTxDoneUs            = 0;
    sRadioProcessTxDoneUs     = 0;
    sNotifyUartTxSendUs       = 0;
    sNotifyUartTxDoneUs       = 0;
    sNotifySpinelEndFrameUs   = 0;
    sNotifyEncodeAndSendUs    = 0;
    sHostCmdEndRxIrqUs        = 0;
    sAwaitingHostCmd          = false;
    sBurstInterFrame          = false;
}

void nrf54RcpTputStatsNoteUartEndRxIrq(void)
{
    sUartEndRxIrqUs = nrf54RcpTputStatsNowUs();
    g_nrf54_rcp_tput_stats.uart_endrx_irq++;

    if (sAwaitingHostCmd)
    {
        sHostCmdEndRxIrqUs = sUartEndRxIrqUs;
    }
}

void nrf54RcpTputStatsNoteUartProcessReceiveStart(void)
{
    uint64_t now = nrf54RcpTputStatsNowUs();
    uint64_t irq = sUartEndRxIrqUs;

    if (irq != 0 && now >= irq)
    {
        uint32_t lagUs = (uint32_t)(now - irq);

        nrf54RcpTputStatsRecordSumMax(&g_nrf54_rcp_tput_stats.uart_endrx_to_process_sum_us,
                                      &g_nrf54_rcp_tput_stats.uart_endrx_to_process_max_us,
                                      lagUs);
    }
}

void nrf54RcpTputStatsNoteUartDelivered(uint32_t aNumBytes)
{
    g_nrf54_rcp_tput_stats.uart_rx_bytes += aNumBytes;
    g_nrf54_rcp_tput_stats.uart_platreceive_calls++;
    sLastUartDeliverUs = nrf54RcpTputStatsNowUs();

    if (sAwaitingHostCmd)
    {
        sAwaitingHostCmd = false;
    }
}

void nrf54RcpTputStatsNoteUartTxSend(void)
{
    uint64_t now = nrf54RcpTputStatsNowUs();

    g_nrf54_rcp_tput_stats.uart_tx_send++;

    if (sRadioProcessTxDoneUs != 0 && sNotifyUartTxDoneUs == 0 && now >= sRadioProcessTxDoneUs &&
        sNotifyUartTxSendUs == 0)
    {
        sNotifyUartTxSendUs = now;
    }
    else if (sRadioTxDoneUs != 0 && sNotifyUartTxDoneUs == 0 && sRadioProcessTxDoneUs == 0 &&
             now >= sRadioTxDoneUs && sNotifyUartTxSendUs == 0)
    {
        sNotifyUartTxSendUs = now;
    }
}

void nrf54RcpTputStatsNoteUartTxReap(void)
{
    g_nrf54_rcp_tput_stats.uart_tx_reap++;
}

void nrf54RcpTputStatsNoteUartTxDone(void)
{
    uint64_t now = nrf54RcpTputStatsNowUs();

    g_nrf54_rcp_tput_stats.uart_tx_done++;

    if (sRadioTxDoneUs != 0 && now >= sRadioTxDoneUs)
    {
        recordLatencySampleMin(&g_nrf54_rcp_tput_stats.lat_radio_done_to_uart_min_us,
                               &g_nrf54_rcp_tput_stats.lat_radio_done_to_uart_max_us,
                               &g_nrf54_rcp_tput_stats.lat_radio_done_to_uart_sum_us,
                               &g_nrf54_rcp_tput_stats.lat_radio_done_to_uart_count,
                               (uint32_t)(now - sRadioTxDoneUs));
    }

    sNotifyUartTxDoneUs = now;
    sAwaitingHostCmd    = true;
    sHostCmdEndRxIrqUs  = 0;
}

void nrf54RcpTputStatsNoteMainLoopDriverPass(void)
{
    g_nrf54_rcp_tput_stats.main_loop_driver_pass++;
}

void nrf54RcpTputStatsNoteTransportPass1(void)
{
    g_nrf54_rcp_tput_stats.transport_pass1++;
}

void nrf54RcpTputStatsNoteTransportPass2(void)
{
    g_nrf54_rcp_tput_stats.transport_pass2++;
}

void nrf54RcpTputStatsNoteRadioTxEnter(bool aCsma)
{
    uint64_t now = nrf54RcpTputStatsNowUs();

    g_nrf54_rcp_tput_stats.radio_tx_enter++;

    if (aCsma)
    {
        g_nrf54_rcp_tput_stats.radio_tx_csma++;
    }
    else
    {
        g_nrf54_rcp_tput_stats.radio_tx_raw++;
    }

    sRadioTxStartUs        = now;
    sRadioTxFrameStartedUs = 0;
    sBurstInterFrame       = false;

    if (sRadioTxDoneUs != 0 && now >= sRadioTxDoneUs)
    {
        uint32_t interFrameUs = (uint32_t)(now - sRadioTxDoneUs);

        recordLatencySampleMin(&g_nrf54_rcp_tput_stats.lat_radio_done_to_tx_enter_min_us,
                               &g_nrf54_rcp_tput_stats.lat_radio_done_to_tx_enter_max_us,
                               &g_nrf54_rcp_tput_stats.lat_radio_done_to_tx_enter_sum_us,
                               &g_nrf54_rcp_tput_stats.lat_radio_done_to_tx_enter_count,
                               interFrameUs);

        if (interFrameUs <= NRF54_RCP_TPUT_BURST_INTER_FRAME_MAX_US)
        {
            sBurstInterFrame = true;

            recordBurstSample(&g_nrf54_rcp_tput_stats.burst_done_to_tx_enter_min_us,
                              &g_nrf54_rcp_tput_stats.burst_done_to_tx_enter_max_us,
                              &g_nrf54_rcp_tput_stats.burst_done_to_tx_enter_sum_us,
                              &g_nrf54_rcp_tput_stats.burst_done_to_tx_enter_count,
                              interFrameUs);
        }
    }

