Antoniazdz/ot-nrf528xx/src/nrf54l15/nrf54_rcp_tput_stats.c
    if (sLastUartDeliverUs != 0 && now >= sLastUartDeliverUs)
    {
        uint32_t uartToRadioUs = (uint32_t)(now - sLastUartDeliverUs);

        recordLatencySampleMin(&g_nrf54_rcp_tput_stats.lat_uart_to_radio_tx_min_us,
                               &g_nrf54_rcp_tput_stats.lat_uart_to_radio_tx_max_us,
                               &g_nrf54_rcp_tput_stats.lat_uart_to_radio_tx_sum_us,
                               &g_nrf54_rcp_tput_stats.lat_uart_to_radio_tx_count,
                               uartToRadioUs);

        if (sBurstInterFrame)
        {
            recordBurstSample(&g_nrf54_rcp_tput_stats.burst_uart_to_radio_min_us,
                              NULL,
                              &g_nrf54_rcp_tput_stats.burst_uart_to_radio_sum_us,
                              &g_nrf54_rcp_tput_stats.burst_uart_to_radio_count,
                              uartToRadioUs);
        }
    }

    if (sRadioTxDoneUs != 0 && sLastUartDeliverUs != 0 && sLastUartDeliverUs >= sRadioTxDoneUs)
    {
        uint32_t hostPathUs = (uint32_t)(sLastUartDeliverUs - sRadioTxDoneUs);

        recordLatencySampleMin(&g_nrf54_rcp_tput_stats.lat_host_path_min_us,
                               &g_nrf54_rcp_tput_stats.lat_host_path_max_us,
                               &g_nrf54_rcp_tput_stats.lat_host_path_sum_us,
                               &g_nrf54_rcp_tput_stats.lat_host_path_count,
                               hostPathUs);

        if (sBurstInterFrame)
        {
            recordBurstSample(&g_nrf54_rcp_tput_stats.burst_host_path_min_us,
                              NULL,
                              &g_nrf54_rcp_tput_stats.burst_host_path_sum_us,
                              &g_nrf54_rcp_tput_stats.burst_host_path_count,
                              hostPathUs);
            recordBurstHostPathBreakdown(hostPathUs);
        }
    }
}

void nrf54RcpTputStatsNoteRadioTxFrameStarted(void)
{
    uint64_t now = nrf54RcpTputStatsNowUs();

    sRadioTxFrameStartedUs = now;

    if (sRadioTxStartUs != 0 && now >= sRadioTxStartUs)
    {
        uint32_t csmaUs = (uint32_t)(now - sRadioTxStartUs);

        recordLatencySampleMin(&g_nrf54_rcp_tput_stats.lat_radio_csma_min_us,
                               &g_nrf54_rcp_tput_stats.lat_radio_csma_max_us,
                               &g_nrf54_rcp_tput_stats.lat_radio_csma_sum_us,
                               &g_nrf54_rcp_tput_stats.lat_radio_csma_count,
                               csmaUs);
        recordCsmaHistogram(csmaUs);

        if (sBurstInterFrame)
        {
            recordBurstSample(&g_nrf54_rcp_tput_stats.burst_csma_min_us,
                              NULL,
                              &g_nrf54_rcp_tput_stats.burst_csma_sum_us,
                              &g_nrf54_rcp_tput_stats.burst_csma_count,
                              csmaUs);
        }
    }

    sBurstInterFrame = false;
}

void nrf54RcpTputStatsNoteRadioFemFromSleep(void)
{
    g_nrf54_rcp_tput_stats.radio_fem_from_sleep++;
}

void nrf54RcpTputStatsNoteRadioTxComplete(bool aOk, bool aBusyChannel)
{
    uint64_t now = nrf54RcpTputStatsNowUs();

    sRadioTxDoneUs         = now;
    sRadioProcessTxDoneUs  = 0;
    sNotifyUartTxSendUs    = 0;
    sNotifyUartTxDoneUs    = 0;
    sNotifySpinelEndFrameUs = 0;
    sNotifyEncodeAndSendUs = 0;
    sHostCmdEndRxIrqUs     = 0;
    sAwaitingHostCmd       = false;

    if (aOk)
    {
        g_nrf54_rcp_tput_stats.radio_tx_done_ok++;
    }
    else if (aBusyChannel)
    {
        g_nrf54_rcp_tput_stats.radio_tx_fail_busy++;
    }
    else
    {
        g_nrf54_rcp_tput_stats.radio_tx_fail_no_ack++;
    }

    if (sRadioTxStartUs != 0 && now >= sRadioTxStartUs)
    {
        uint32_t latencyUs = (uint32_t)(now - sRadioTxStartUs);

        recordLatencySample(&g_nrf54_rcp_tput_stats.lat_radio_tx_max_us,
                            &g_nrf54_rcp_tput_stats.lat_radio_tx_sum_us,
                            &g_nrf54_rcp_tput_stats.lat_radio_tx_count,
                            latencyUs);
        recordRadioTxLatencyHistogram(latencyUs);
    }

    if (sRadioTxFrameStartedUs != 0 && now >= sRadioTxFrameStartedUs)
    {
        recordLatencySample(&g_nrf54_rcp_tput_stats.lat_radio_onair_max_us,
                            &g_nrf54_rcp_tput_stats.lat_radio_onair_sum_us,
                            &g_nrf54_rcp_tput_stats.lat_radio_onair_count,
                            (uint32_t)(now - sRadioTxFrameStartedUs));
    }

    sRadioTxFrameStartedUs = 0;
}

void nrf54RcpTputStatsNoteRadioProcessTxDone(void)
{
    uint64_t now = nrf54RcpTputStatsNowUs();

    g_nrf54_rcp_tput_stats.radio_process_tx_done++;

    if (sRadioTxDoneUs != 0 && now >= sRadioTxDoneUs)
    {
        sRadioProcessTxDoneUs = now;
    }
}

void nrf54RcpTputStatsNoteLptimerFire(uint32_t aSlipTicks)
{
    recordLptimerSlipHistogram(aSlipTicks);
}

void nrf_802154_platform_rcp_tput_stats_tx_frame_started(void)
{
    nrf54RcpTputStatsNoteRadioTxFrameStarted();
}

void nrf_802154_platform_rcp_tput_stats_lptimer_fire(uint32_t aSlipTicks)
{
    nrf54RcpTputStatsNoteLptimerFire(aSlipTicks);
}

void nrf54RcpTputStatsNoteCsmaCcaBusy(void)
{
    g_nrf54_rcp_tput_stats.csma_cca_busy++;
}

void nrf54RcpTputStatsNoteCsmaBackoffScheduled(void)
{
    g_nrf54_rcp_tput_stats.csma_backoff_scheduled++;
}

void nrf54RcpTputStatsNoteCsmaOnAir(uint8_t aBackoffAttempts)
{
    if (aBackoffAttempts == 0u)
    {
        g_nrf54_rcp_tput_stats.csma_onair_nb_0++;
    }
    else if (aBackoffAttempts == 1u)
    {
        g_nrf54_rcp_tput_stats.csma_onair_nb_1++;
    }
    else
    {
        g_nrf54_rcp_tput_stats.csma_onair_nb_2plus++;
    }
}

void nrf54RcpTputStatsNoteLinkRawEndFrame(void)
{
    if (sRadioProcessTxDoneUs != 0 && sNotifyUartTxSendUs == 0 && sNotifySpinelEndFrameUs == 0)
    {
        sNotifySpinelEndFrameUs = nrf54RcpTputStatsNowUs();
    }
}

void nrf54RcpTputStatsNoteHdlcEncodeAndSendEnter(void)
{
    if (sRadioProcessTxDoneUs != 0 && sNotifyUartTxSendUs == 0 && sNotifyEncodeAndSendUs == 0)
    {
        sNotifyEncodeAndSendUs = nrf54RcpTputStatsNowUs();
    }
}

void nrf54RcpTputStatsNoteUartTxBusy(void)
{
    g_nrf54_rcp_tput_stats.uart_tx_busy++;
}

void nrf54_rcp_tput_ncp_note_link_raw_end_frame(void)
{
    nrf54RcpTputStatsNoteLinkRawEndFrame();
}

void nrf54_rcp_tput_ncp_note_hdlc_encode_and_send_enter(void)
{
    nrf54RcpTputStatsNoteHdlcEncodeAndSendEnter();
}

void nrf_802154_platform_rcp_tput_stats_csma_cca_busy(void)
{
    nrf54RcpTputStatsNoteCsmaCcaBusy();
}

void nrf_802154_platform_rcp_tput_stats_csma_backoff_scheduled(void)
{
    nrf54RcpTputStatsNoteCsmaBackoffScheduled();
}

void nrf_802154_platform_rcp_tput_stats_csma_on_air(uint8_t aBackoffAttempts)
{
    nrf54RcpTputStatsNoteCsmaOnAir(aBackoffAttempts);
}

static uint32_t avgUs(uint32_t sum, uint32_t count)
{
    return (count == 0u) ? 0u : (sum / count);
}

void nrf54RcpTputStatsDumpRtt(void)
{
    char     line[160];
    uint32_t passCount = g_nrf54_rcp_tput_stats.main_loop_driver_pass;

    SEGGER_RTT_WriteString(0, "\r\n=== nrf54 RCP tput stats ===\r\n");

    snprintf(line, sizeof(line), "driver_pass=%u transport1=%u transport2=%u\r\n", passCount,
             g_nrf54_rcp_tput_stats.transport_pass1, g_nrf54_rcp_tput_stats.transport_pass2);
    SEGGER_RTT_WriteString(0, line);

