Antoniazdz/ot-nrf528xx/src/nrf54l15/nrf54_rcp_tput_stats.c
    snprintf(line, sizeof(line),
             "pass_total max/avg_us=%u/%u alarm=%u/%u t1=%u/%u radio=%u/%u t2=%u/%u\r\n",
             g_nrf54_rcp_tput_stats.pass_total_max_us, avgUs(g_nrf54_rcp_tput_stats.pass_total_sum_us, passCount),
             g_nrf54_rcp_tput_stats.pass_alarm_max_us, avgUs(g_nrf54_rcp_tput_stats.pass_alarm_sum_us, passCount),
             g_nrf54_rcp_tput_stats.pass_transport1_max_us,
             avgUs(g_nrf54_rcp_tput_stats.pass_transport1_sum_us, passCount),
             g_nrf54_rcp_tput_stats.pass_radio_max_us, avgUs(g_nrf54_rcp_tput_stats.pass_radio_sum_us, passCount),
             g_nrf54_rcp_tput_stats.pass_transport2_max_us,
             avgUs(g_nrf54_rcp_tput_stats.pass_transport2_sum_us, passCount));
    SEGGER_RTT_WriteString(0, line);

    snprintf(line, sizeof(line),
             "uart endrx=%u paused=%u bytes=%u endrx->proc max/avg=%u/%u\r\n",
             g_nrf54_rcp_tput_stats.uart_endrx_irq, g_nrf54_rcp_tput_stats.uart_rx_paused,
             g_nrf54_rcp_tput_stats.uart_rx_bytes, g_nrf54_rcp_tput_stats.uart_endrx_to_process_max_us,
             avgUs(g_nrf54_rcp_tput_stats.uart_endrx_to_process_sum_us, g_nrf54_rcp_tput_stats.uart_endrx_irq));
    SEGGER_RTT_WriteString(0, line);

    snprintf(line, sizeof(line),
             "lat uart->radio max/avg=%u/%u radio_tx max/avg=%u/%u done->uart max/avg=%u/%u\r\n",
             g_nrf54_rcp_tput_stats.lat_uart_to_radio_tx_max_us,
             avgUs(g_nrf54_rcp_tput_stats.lat_uart_to_radio_tx_sum_us,
                   g_nrf54_rcp_tput_stats.lat_uart_to_radio_tx_count),
             g_nrf54_rcp_tput_stats.lat_radio_tx_max_us,
             avgUs(g_nrf54_rcp_tput_stats.lat_radio_tx_sum_us, g_nrf54_rcp_tput_stats.lat_radio_tx_count),
             g_nrf54_rcp_tput_stats.lat_radio_done_to_uart_max_us,
             avgUs(g_nrf54_rcp_tput_stats.lat_radio_done_to_uart_sum_us,
                   g_nrf54_rcp_tput_stats.lat_radio_done_to_uart_count));
    SEGGER_RTT_WriteString(0, line);

    snprintf(line, sizeof(line),
             "lat done->tx_enter min/max/avg=%u/%u/%u csma min/max/avg=%u/%u/%u onair max/avg=%u/%u\r\n",
             g_nrf54_rcp_tput_stats.lat_radio_done_to_tx_enter_min_us == UINT32_MAX
                 ? 0u
                 : g_nrf54_rcp_tput_stats.lat_radio_done_to_tx_enter_min_us,
             g_nrf54_rcp_tput_stats.lat_radio_done_to_tx_enter_max_us,
             avgUs(g_nrf54_rcp_tput_stats.lat_radio_done_to_tx_enter_sum_us,
                   g_nrf54_rcp_tput_stats.lat_radio_done_to_tx_enter_count),
             g_nrf54_rcp_tput_stats.lat_radio_csma_min_us == UINT32_MAX ? 0u
                                                                        : g_nrf54_rcp_tput_stats.lat_radio_csma_min_us,
             g_nrf54_rcp_tput_stats.lat_radio_csma_max_us,
             avgUs(g_nrf54_rcp_tput_stats.lat_radio_csma_sum_us, g_nrf54_rcp_tput_stats.lat_radio_csma_count),
             g_nrf54_rcp_tput_stats.lat_radio_onair_max_us,
             avgUs(g_nrf54_rcp_tput_stats.lat_radio_onair_sum_us, g_nrf54_rcp_tput_stats.lat_radio_onair_count));
    SEGGER_RTT_WriteString(0, line);

    snprintf(line, sizeof(line),
             "host_path min/max/avg=%u/%u/%u csma_hist=[%u,%u,%u,%u,%u]\r\n",
             g_nrf54_rcp_tput_stats.lat_host_path_min_us == UINT32_MAX ? 0u
                                                                       : g_nrf54_rcp_tput_stats.lat_host_path_min_us,
             g_nrf54_rcp_tput_stats.lat_host_path_max_us,
             avgUs(g_nrf54_rcp_tput_stats.lat_host_path_sum_us, g_nrf54_rcp_tput_stats.lat_host_path_count),
             g_nrf54_rcp_tput_stats.csma_hist_0_320, g_nrf54_rcp_tput_stats.csma_hist_320_640,
             g_nrf54_rcp_tput_stats.csma_hist_640_1280, g_nrf54_rcp_tput_stats.csma_hist_1280_2000,
             g_nrf54_rcp_tput_stats.csma_hist_2000_plus);
    SEGGER_RTT_WriteString(0, line);

    snprintf(line, sizeof(line),
             "burst(<20ms) done->tx min/avg=%u/%u host min/avg=%u/%u uart->radio min/avg=%u/%u csma min/avg=%u/%u n=%u\r\n",
             g_nrf54_rcp_tput_stats.burst_done_to_tx_enter_min_us == UINT32_MAX
                 ? 0u
                 : g_nrf54_rcp_tput_stats.burst_done_to_tx_enter_min_us,
             avgUs(g_nrf54_rcp_tput_stats.burst_done_to_tx_enter_sum_us,
                   g_nrf54_rcp_tput_stats.burst_done_to_tx_enter_count),
             g_nrf54_rcp_tput_stats.burst_host_path_min_us == UINT32_MAX ? 0u
                                                                           : g_nrf54_rcp_tput_stats.burst_host_path_min_us,
             avgUs(g_nrf54_rcp_tput_stats.burst_host_path_sum_us, g_nrf54_rcp_tput_stats.burst_host_path_count),
             g_nrf54_rcp_tput_stats.burst_uart_to_radio_min_us == UINT32_MAX ? 0u
                                                                              : g_nrf54_rcp_tput_stats.burst_uart_to_radio_min_us,
             avgUs(g_nrf54_rcp_tput_stats.burst_uart_to_radio_sum_us,
                   g_nrf54_rcp_tput_stats.burst_uart_to_radio_count),
             g_nrf54_rcp_tput_stats.burst_csma_min_us == UINT32_MAX ? 0u
                                                                     : g_nrf54_rcp_tput_stats.burst_csma_min_us,
             avgUs(g_nrf54_rcp_tput_stats.burst_csma_sum_us, g_nrf54_rcp_tput_stats.burst_csma_count),
             g_nrf54_rcp_tput_stats.burst_done_to_tx_enter_count);
    SEGGER_RTT_WriteString(0, line);

    snprintf(line, sizeof(line),
             "host_path burst min us: notify=%u stack=%u uart_prep=%u host_rtt=%u rx_proc=%u\r\n",
             g_nrf54_rcp_tput_stats.burst_rcp_notify_min_us == UINT32_MAX
                 ? 0u
                 : g_nrf54_rcp_tput_stats.burst_rcp_notify_min_us,
             g_nrf54_rcp_tput_stats.burst_rcp_stack_min_us == UINT32_MAX ? 0u
                                                                          : g_nrf54_rcp_tput_stats.burst_rcp_stack_min_us,
             g_nrf54_rcp_tput_stats.burst_rcp_uart_prep_min_us == UINT32_MAX
                 ? 0u
                 : g_nrf54_rcp_tput_stats.burst_rcp_uart_prep_min_us,
             g_nrf54_rcp_tput_stats.burst_host_rtt_min_us == UINT32_MAX ? 0u
                                                                         : g_nrf54_rcp_tput_stats.burst_host_rtt_min_us,
             g_nrf54_rcp_tput_stats.burst_uart_rx_proc_min_us == UINT32_MAX
                 ? 0u
                 : g_nrf54_rcp_tput_stats.burst_uart_rx_proc_min_us);
    SEGGER_RTT_WriteString(0, line);

