Antoniazdz/ot-nrf528xx/src/nrf54l15/nrf54_rcp_tput_stats.c
    snprintf(line, sizeof(line),
             "uart_prep v6 burst min: spinel=%u defer=%u hdlc=%u uart_tx_busy=%u\r\n",
             g_nrf54_rcp_tput_stats.burst_rcp_spinel_encode_min_us == UINT32_MAX
                 ? 0u
                 : g_nrf54_rcp_tput_stats.burst_rcp_spinel_encode_min_us,
             g_nrf54_rcp_tput_stats.burst_rcp_tasklet_defer_min_us == UINT32_MAX
                 ? 0u
                 : g_nrf54_rcp_tput_stats.burst_rcp_tasklet_defer_min_us,
             g_nrf54_rcp_tput_stats.burst_rcp_hdlc_encode_min_us == UINT32_MAX
                 ? 0u
                 : g_nrf54_rcp_tput_stats.burst_rcp_hdlc_encode_min_us,
             g_nrf54_rcp_tput_stats.uart_tx_busy);
    SEGGER_RTT_WriteString(0, line);

    snprintf(line, sizeof(line),
             "csma driver: cca_busy=%u backoff_sched=%u onair_nb=[%u,%u,%u]\r\n",
             g_nrf54_rcp_tput_stats.csma_cca_busy, g_nrf54_rcp_tput_stats.csma_backoff_scheduled,
             g_nrf54_rcp_tput_stats.csma_onair_nb_0, g_nrf54_rcp_tput_stats.csma_onair_nb_1,
             g_nrf54_rcp_tput_stats.csma_onair_nb_2plus);
    SEGGER_RTT_WriteString(0, line);

    snprintf(line, sizeof(line),
             "lptimer slip ticks avg=%u/%u hist=[%u,%u,%u,%u] fires=%u\r\n",
             g_nrf54_rcp_tput_stats.lptimer_slip_sum_ticks,
             avgUs(g_nrf54_rcp_tput_stats.lptimer_slip_sum_ticks, g_nrf54_rcp_tput_stats.lptimer_slip_count),
             g_nrf54_rcp_tput_stats.lptimer_slip_0_10, g_nrf54_rcp_tput_stats.lptimer_slip_10_50,
             g_nrf54_rcp_tput_stats.lptimer_slip_50_200, g_nrf54_rcp_tput_stats.lptimer_slip_200_plus,
             g_nrf54_rcp_tput_stats.lptimer_fires);
    SEGGER_RTT_WriteString(0, line);

    snprintf(line, sizeof(line),
             "radio tx=%u csma=%u ok=%u busy=%u noack=%u fem=%u hist=[%u,%u,%u,%u]\r\n",
             g_nrf54_rcp_tput_stats.radio_tx_enter, g_nrf54_rcp_tput_stats.radio_tx_csma,
             g_nrf54_rcp_tput_stats.radio_tx_done_ok, g_nrf54_rcp_tput_stats.radio_tx_fail_busy,
             g_nrf54_rcp_tput_stats.radio_tx_fail_no_ack, g_nrf54_rcp_tput_stats.radio_fem_from_sleep,
             g_nrf54_rcp_tput_stats.radio_tx_lat_0_100, g_nrf54_rcp_tput_stats.radio_tx_lat_100_500,
             g_nrf54_rcp_tput_stats.radio_tx_lat_500_2000, g_nrf54_rcp_tput_stats.radio_tx_lat_2000_plus);
    SEGGER_RTT_WriteString(0, line);

    SEGGER_RTT_WriteString(0, "=== end stats ===\r\n");
}

#endif // NRF54_RCP_TPUT_STATS
